Repository: wechiwin/time
Catalog: backend/translations/*/LC_MESSAGES/messages.po
Languages: it, zh

# COL_HO_CODE
source: Code
it: Codice
zh: 持仓代码

# COL_HO_NAME
source: Name
it: Nome
zh: 持仓名称

# COL_HO_TYPE
source: Type
it: Tipo
zh: 持仓类型

# COL_HO_ESTABLISH_DATE
source: Establish Date
it: Data di Costituzione
zh: 成立日期

# COL_HO_SHORT_NAME
source: Short Name
it: Nome Breve
zh: 持仓简称

# COL_HO_MANAGE_EXP_RATE
source: Management Expense Rate
it: Commissione di Gestione
zh: 基金管理费率

# COL_HO_TRUSTEE_EXP_RATE
source: Trustee Expense Rate
it: Commissione di Custodia
zh: 基金托管费率

# COL_HO_SALES_EXP_RATE
source: Sales Expense Rate
it: Commissione di Vendita
zh: 基金销售费率

# COL_HO_STATUS
source: Status
it: Stato
zh: 状态

# COL_HO_NICKNAME
source: Nickname
it: Soprannome

# HO_LOG
source: Holding Log
it: Registro delle Posizioni
zh: 持仓记录

# HO_STATUS_HOLDING
source: Holding
it: In possesso
zh: 持仓中

# HO_STATUS_NOT_HOLDING
source: Not Holding
it: Non in possesso
zh: 未持仓

# HO_STATUS_CLEARED
source: Cleared
it: Liquidato
zh: 已清仓

# COL_TR_TYPE
source: Trade Type
it: Tipo di Transazione
zh: 交易类型

# COL_TR_DATE
source: Trade Date
it: Data di Transazione
zh: 交易日期

# COL_TR_NAV_PER_UNIT
source: NAV Per Unit
it: Valore netto
zh: 单位净值

# COL_TR_SHARES
source: Trade Shares
it: Azioni della transazione
zh: 交易份数

# COL_CASH_AMOUNT
source: Gross Amount
it: Importo Lordo
zh: 交易本金

# COL_TR_FEE
source: Trade Fee
it: Commissione della transazione
zh: 交易费用

# COL_TR_AMOUNT
source: Net Amount
it: Importo Netto
zh: 交易净额

# TEMPLATE_TR_IMPORT
source: Trade Import Template
it: Modello di importazione
zh: 交易记录导入模板

# TEMPLATE_HO_IMPORT
source: Holding Import Template
it: Modello di importazione fondi
zh: 基金导入模板

# TR_BUY
source: Buy
it: Acquisto
zh: 买入

# TR_SELL
source: Sell
it: Vendita
zh: 卖出

# TR_DIVIDEND
source: Dividend
it: Dividendo
zh: 分红

# CASH
source: Cash Dividend
it: Dividendo
zh: 现金分红

# REINVEST
source: Dividend Reinvestment
it: Reinvestimento del Dividendo
zh: 分红再投资

# TR_LOG
source: Trade Log
it: Registri delle transazioni
zh: 交易记录

# TR_EXAMPLE
source: Example
it: Esempio
zh: 示例

# AR_EM_PENDING
source: Pending
it: Da inviare
zh: 待发送

# AR_EM_SENT
source: Sent
it: Inviato
zh: 已发送

# AR_EM_FAILED
source: Failed
it: Invio fallito
zh: 发送失败

# AR_TR_ADD_POSITION
source: Add Position
it: Aggiungi Posizione
zh: 加仓

# EMAIL_SUBJECT_TRIGGER_ALERT
source: Monitoring Trigger Alert
it: Avviso di Attivazione del Monitoraggio
zh: 监控触发提醒

# EMAIL_TITLE
source: Portfolio Monitoring Alert
it: Avviso di monitoraggio del portafoglio
zh: 持仓监控触发通知

# RECIPIENT_TITLE
source: Dear
it: Gentile
zh: 尊敬的用户

# CONTENT_FIRST
source: Your monitoring
it: Il tuo monitoraggio
zh: 您的监控

# CONTENT_SECOND
source: has been triggered
it: è stato attivato
zh: 已触发

# COL_AH_TRIGGER_NAV_DATE
source: Trigger Date
it: Data di attivazione
zh: 触发日期

# COL_AH_NAV_PER_UNIT
source: NAV on Trigger Date
it: Valore quota alla data di attivazione
zh: 触发单位净值

# COL_AH_TARGET_NAVPU
source: Target NAV
it: Valore obiettivo
zh: 监控净值

# COL_AH_AR_TYPE
source: Recommended Action
it: Azione consigliata
zh: 建议操作

# EMAIL_DO_NOT_REPLY
source: This email is auto-generated by the system, please do not reply.
it: Questa email è generata automaticamente dal sistema, non rispondere.
zh: 此邮件由系统自动发送，请勿直接回复。

source: All rights reserved
it: Tutti i diritti riservati
zh: 版权所有

# HOLDING_TYPE_FUND
source: Fund
it: Fondo
zh: 基金

# HOLDING_TYPE_STOCK
source: Stock
it: Azione
zh: 股票

# FD_TR_EX
source: On-Exchange
it: Mercato regolamentato
zh: 场内交易

# FD_TR_OFF_EX
source: Off-Exchange
it: Fuori mercato
zh: 场外交易

# FD_TR_BOTH
source: Both(on/off)
it: Entrambi
zh: 内外皆可

# FD_DIVIDEND_REINVEST
source: Dividend Reinvestment
it: Reinvestimento dei Dividendi
zh: 分红再投资

# FD_DIVIDEND_CASH
source: Cash Dividend
it: Dividendo in Contanti
zh: 现金分红

source: Pending
it: In sospeso
zh: 等待中

source: Running
it: In corso
zh: 执行中

source: Success
it: Successo
zh: 执行成功

source: Retrying
it: Ripetizione
zh: 重试中

source: Failed
it: Fallito
zh: 执行失败

source: Cancelled
it: Annullato
zh: 手动取消

# MISSING_FIELD
source: Required field missing
it: Campo obbligatorio mancante
zh: 字段缺失

source: Data not found
it: Dati non trovati
zh: 数据不存在

source: Duplicate data
it: Dati duplicati
zh: 数据重复

# OVERSOLD
source: Sell shares cannot exceed buy shares
it: Le azioni in vendita non possono superare quelle in acquisto
zh: 卖出份额不可超过买入份额

# NO_AUTH
source: Insufficient permissions
it: Autorizzazioni insufficienti
zh: 权限不足

# NOT_TRADE_DAY
source: Non-trading day
it: Giorno non negoziale
zh: 非交易日

source: Operation failed
it: Operazione non riuscita
zh: 操作失败

# NO_UPLOAD_FILE
source: No file uploaded
it: Nessun file caricato
zh: 未上传文件

# CRAWL_NO_INFO
source: No data crawled
it: Nessun dato estratto
zh: 爬取无结果

# USERNAME_PASSWORD_REQUIRED
source: Username and password are required
it: Nome utente e password sono obbligatori
zh: 用户名和密码不能为空

# USERNAME_MIN_PASSWORD_MIN
source: Username must be at least 3 characters, password must be at least 6 characters
it: Il nome utente deve contenere almeno 3 caratteri, la password almeno 6
zh: 用户名至少3位，密码至少6位

source: Username already exists
it: Il nome utente esiste già
zh: 用户名已存在

# REGISTRATION_FAILED
source: Registration failed, please try again later
it: Registrazione non riuscita, riprova più tardi
zh: 注册失败，请稍后再试

# INVALID_REQUEST_MISSING_SECURITY_HEADER
source: Invalid request: missing security identifier
it: Richiesta non valida: identificativo di sicurezza mancante
zh: 非法请求：缺少安全标识

# TOKEN_EXPIRED
source: Token has expired
it: Token scaduto
zh: Token 已过期

# TOKEN_INVALID
source: Token is invalid
it: Token non valido
zh: Token 无效

source: Refresh token failed
it: Refresh del token non riuscito
zh: 刷新 token 失败

source: User not found
it: Utente non trovato
zh: 用户不存在

# OLD_NEW_PASSWORD_REQUIRED
source: Old password and new password are required
it: La vecchia password e la nuova password sono obbligatori
zh: 原密码和新密码都不能为空

# NEW_PASSWORD_SAME_AS_OLD
source: New password cannot be the same as old password
it: La nuova password non può essere uguale alla vecchia
zh: 新密码不能与原密码相同

# NEW_PASSWORD_MIN_LENGTH
source: New password must be at least 6 characters
it: La nuova password deve contenere almeno 6 caratteri
zh: 新密码至少6位

# OLD_PASSWORD_INCORRECT
source: Old password is incorrect
it: La vecchia password non è corretta
zh: 原密码错误

# PASSWORD_CHANGE_FAILED
source: Failed to change password
it: Modifica della password non riuscita
zh: 密码修改失败

source: Logout failed
it: Logout non riuscito
zh: 登出失败

source: Missing date range
it: Intervallo di date mancante
zh: 缺少时间限制

source: No file uploaded
it: Nessun file caricato
zh: 没有上传文件

source: No file selected
it: Nessun file selezionato
zh: 没有选择文件

# EXCEL_MISSING_REQUIRED_COLUMNS
source: Excel is missing required columns
it: Excel manca le colonne richieste
zh: Excel缺少必要列

# TRADE_TYPE_NOT_RECOGNIZED
source: Trade type "%(value)s" is not recognized, please use the dropdown options provided in the template.
it: Tipo di transazione "%(value)s" non riconosciuto, per favore usa le opzioni del menu a tendina fornite nel modello.
zh: 交易类型"%(value)s"无法识别，请使用模板提供的下拉选项。

# ALERT_RECORD_CREATE_FAILED
source: Failed to create alert record
it: Creazione del record di allarme non riuscita
zh: 提醒记录创建失败

# USER_EMAIL_NOT_EXISTS
source: User email does not exist
it: Email dell'utente non esistente
zh: 用户邮箱不存在

# SEND_EMAIL_FAILED
source: Failed to send email: %(error)s
it: Invio email non riuscito: %(error)s
zh: 发送提醒邮件失败: %(error)s

# FUND_CODE_NOT_IN_HOLDINGS
source: The following fund codes do not exist in the holdings table, please add them first: %(codes)s
it: I seguenti codici fondo non esistono nella tabella delle posizioni, si prega di aggiungerli prima: %(codes)s
zh: 以下基金代码不存在于持仓表中，请先添加: %(codes)s

# FUND_IMPORT_FAILED_OVERSOLD
source: Fund %(ho_code)s import failed: attempted to sell %(trade_shares)s shares on %(trade_tr_date)s, but only had %(current_shares)s shares at that time.
it: Importazione fondo %(ho_code)s non riuscita: tentato di vendere %(trade_shares)s azioni il %(trade_tr_date)s, ma ne aveva solo %(current_shares)s in quel momento.
zh: 基金 %(ho_code)s 导入失败: 交易日 %(trade_tr_date)s 尝试卖出 %(trade_shares)s 份, 但当时仅持有 %(current_shares)s 份。

# IMPORT_PROCESS_ERROR
source: An unknown error occurred during import
it: Si è verificato un errore sconosciuto durante l'importazione
zh: 导入过程中发生未知错误

# HOLDING_NOT_EXISTS
source: Holding does not exist
it: Posizione non esistente
zh: 持仓不存在

# OPERATION_OVERSOLD
source: Operation caused inventory shortage: after selling on %(trade_tr_date)s, holding shares became %(current_shares)s, which violates business rules.
it: Operazione ha causato carenza di inventario: dopo la vendita il %(trade_tr_date)s, le azioni di posizione sono diventate %(current_shares)s, che viola le regole aziendali.
zh: 操作导致库存不足：在 %(trade_tr_date)s 卖出后，持仓份额变为 %(current_shares)s，不符合业务规则。

# CRAWL_PAGE_ERROR
source: %(ho_code)s error crawling page %(page)s
it: %(ho_code)s errore durante l'estrazione della pagina %(page)s
zh: %(ho_code)s 爬取第 %(page)s 页出错

# DATA_SAVE_FAILED
source: %(ho_code)s data save failed
it: %(ho_code)s salvataggio dati non riuscito
zh: %(ho_code)s 数据保存失败
